Repository: GerZah/plugin-MeasurementSearch
Catalog: languages/*.po
Languages: de_de

source: Measurement Search Debug Output
de_de: Maße-Suche Debug-Ausgabe

source: Units
de_de: Einheiten

source: Please enter all units that you would like to support, one per line.<br><em>Please note:</em> Units name may not be longer than 20 characters.
de_de: Bitte geben Sie alle Einheiten ein, die Sie unterstützen wollen, eine pro Zeile.<br><em>Bitte beachten:</em> Einheiten dürfen maximal 20 Zeichen lang sein.

source: Scan All Text Fields
de_de: Alle Textfelder durchsuchen

source: Check this if you want measurements processing to be carried out within all of an item's text fields.
de_de: Wählen Sie dies aus, wenn Sie Maße in allen Textfeldern eines Objektes suchen wollen.

source: Limit Scan to Fields
de_de: Suche auf Felder beschränken

source: Please select the elements i.e. fields that the scan for measurements should be limited to.<br><em>Please note:</em> To select multiple entries, try holding the Ctrl key (Windows) or the Cmd key (Mac) while clicking.
de_de: Bitte wählen Sie die Elemente bzw. Felder, auf die die Suche nach Maßen beschränkt sein soll.<br><em>Bitte beachten Sie:</em> Um mehrere Einträge auszuwählen, halten Sie bitte während des Klickens die Strg-Taste (Windows) bzw. die Command-Taste (Mac) gedrückt.

source: Scan Inside Relationship Comments
de_de: Innerhalb von Objekt-Beziehungs-Kommentaren suchen

source: The Item Relationships add-on is installed, and it has been patched to feature relationship comments. Check this if you want Measurement Search to scan inside relationship comments.
de_de: Das Objekt-Beziehungen (Item Relationships) Add-on ist installiert, und es ist gepatcht, um Beziehungs-Kommentare zu unterstützen. Wählen Sie dies aus, wenn die Suche innerhalb der Beziehungskommentare erfolgen soll.

source: Trigger Re-indexing of Existing Content
de_de: Re-Indexierung von bestehendem Inhalt auslösen

source: <strong>Please note:</strong> Checking this box will re-generate the index <em>now</em> and exactly <em>once</em>. This action will be carried out as soon as you click on "Save Changes".
de_de: <strong>Bitte beachten:</strong> Wenn Sie diese Option auswählen, wird der Index <em>jetzt</em> und genau <em>einmal</em>neu generiert. Diese Aktion wird durchgeführt, sobald Sie auf „Änderungen speichern“ klicken.

source: <em>Explanation:</em> Measurement Search relies on a search index that is being created during content maintenance in the background. However, existing content will not be re-indexed automatically. So if you have existing content or modify your settings, you should re-generate the search index.
de_de: <em>Erläuterung:</em> Die Maße-Suche stützt sich auf einen Suchindex, der während der Inhaltspflege im Hintergrund erstellt wird. Jedoch werden vorhandene Inhalte nicht automatisch erneut indexiert. Sofern Ihre Datenbank also über bestehende Inhalte verfügt, oder wenn Sie Ihre Einstellungen ändern, sollten Sie den Suchindex neu generieren.

source: Debug Output
de_de: Debug-Ausgabe

source: Measurement Search
de_de: Maße-Suche

source: You may enter a number in the forms XXXX or XXXX-YYYY. You may also select one of the units that you defined to limit the search to. Measurement Search will find items that contain measurements matching your search. For example: "500" will find an item that is either 500 units high, wide, or deep.
de_de: Sie können ein Maß in der Form XXXX oder XXXX-YYYY eingeben. Darüber hinaus können Sie eine von Ihnen gewählte Einheit auswählen, um die Suche zu begrenzen. Die Maße-Suche findet Objekte, die Maße enthalten, die zur Suche passen. Beispielweise wird die Suche nach "500" ein Objekt finden, das 500 Einheiten hoch, breit oder tief ist.
